{"name":"Muhammad Abdur Rehman","headerTaglineOne":"","headerTaglineTwo":"Computer Science Graduate","headerTaglineThree":"Designer,Developer and Marketer","headerTaglineFour":" based in Islamabad","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/muhammadrehman2/"},{"id":"3","title":"Twitter","link":"https://twitter.com/abdus4430"},{"id":"4","title":"Blog","link":"https://blog..com/"},{"id":"5","title":"Email","link":"mailto:abdus4430@gmail.com"}],"projects":[{"id":"1","title":"Project One","description":"E-commerce Website","imageSrc":"https://images.unsplash.com/photo-1487837647815-bbc1f30cd0d2?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njl8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://abdurrehmanstore.vercel.app/"},{"id":"2","title":"Project Two","description":"Automotive Marketplace","imageSrc":"https://images.unsplash.com/photo-1605153864431-a2795a1b2f95?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8MXwyNTY3ODl8fGVufDB8fHw%3D&auto=format&fit=crop&w=400&q=60","url":"https://carselli.netlify.app/"},{"id":"3","title":"Project Three","description":"Design","imageSrc":"https://images.unsplash.com/photo-1504083898675-c896ecdae86e?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjJ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"http://.com/"},{"id":"4","title":"Project Four","description":"Marketing","imageSrc":"https://images.unsplash.com/photo-1492171983775-a51717616c0d?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjB8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"http://chetanverma.com/"},{"id":"5","title":"Project Five","description":"Development","imageSrc":"https://images.unsplash.com/photo-1534239143101-1b1c627395c5?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8NzZ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"http://abdus4430@gmail.com/"},{"id":"6","title":"Project Six","description":"Ride Sharing Service","imageSrc":"public/images/uber.png","url":"https://uberclone22.netlify.app/"}],"services":[{"id":"1","title":"Web Development","description":"I offer end to end web development services that bring ideas to life through modern, responsive, and scalable web applications. My work is built on the MERN stack which includes MongoDB, Express.js, React, and Node.js allowing me to create powerful full stack solutions. I specialize in building clean front end interfaces, developing secure back end APIs, and integrating third party tools such as authentication systems and payment gateways. I also use version control with Git, testing tools like Postman, and deployment platforms such as Vercel or Netlify to ensure that every project is efficient, stable, and production ready. Whether you are launching a portfolio, an ecommerce site, or a custom dashboard, I can build a tailored solution that fits your goals and users."},{"id":"2","title":"Business Development and Marketing","description":"I work at the intersection of business development and marketing to help brands grow through strategic planning and meaningful customer engagement. My approach focuses on identifying new opportunities, building relationships, and creating marketing campaigns that align with business goals. From market research and competitor analysis to content strategy and CRM management, I combine creative thinking with data-driven decision making. I have experience using tools like Google Analytics, HubSpot, and social media platforms to track performance and refine outreach strategies that increase visibility, generate leads, and support long term growth."},{"id":"3","title":"UI/UX Designing","description":"I design user interfaces and experiences that are intuitive, engaging, and aligned with both user needs and business goals. My UI/UX process starts with research and user journey mapping, followed by wireframing, prototyping, and visual design using tools like Figma, Adobe XD, and Miro. I focus on creating accessible and responsive designs that offer seamless interaction across devices. From building low fidelity concepts to delivering polished high fidelity mockups, I ensure every design decision is backed by usability principles and real user feedback."},{"id":"4","title":"Software Quality Assurance and Testing","description":"I ensure the reliability, performance, and functionality of digital products through structured software quality assurance and testing practices. My work involves writing and executing test cases, identifying bugs, and validating user flows across web and mobile platforms. I use tools like Postman, Zest, and browser-based testing frameworks to conduct manual and exploratory testing, with a focus on usability and consistency. By collaborating closely with developers and product teams, I help catch issues early, improve user experience, and maintain a high standard of product quality throughout the development cycle."}],"aboutpara":"I am a motivated and adaptable individual with a passion for building digital experiences that combine creativity, strategy, and technology. With hands-on experience across web development, content writing, UI and UX design, quality assurance, and data analysis, I bring a well-rounded skill set to every project I work on. I enjoy solving problems, learning new tools, and collaborating with diverse teams to create meaningful results. Whether it's crafting clean user interfaces, writing clear content, or optimizing digital workflows, I focus on delivering work that is thoughtful, functional, and user centered.\n\n","resume":{"tagline":" I'm a Developer, product designer and Marketer.","description":"I have developed and deployed full-stack web applications using the MERN stack, gaining practical experience in modern web development. I worked with CRM tools and QA platforms like Postman to streamline workflows and ensure product quality. I also explored computer vision and automation using Python, applying technical solutions to real-world problems.","experiences":[{"id":"1","dates":"June 2022 - August 2022","type":"Remote/Amsterdam","position":"Content Writer and Strategist","bullets":"Created engaging brand-aligned content for web social media and marketing campaigns, Contributed to content strategy by planning messaging defining tone and collaborating across teams to ensure consistency and impact"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"June 2023 - August 2023","type":"Internship","position":"HR and Management Trainee","bullets":"Supported HR operations including recruitment coordination employee onboarding and documentation using CRM and productivity tools, Assisted management with task scheduling  internal reporting and cross-team communication to streamline daily operations"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"June 2024 - August 2024","type":"Internship","position":"IT and Data Analyst","bullets":"Assisted in maintaining IT systems troubleshooting technical issues and generating performance reports for cross-functional teams , Collected cleaned and analyzed data to support decision making and improve operational efficiency using tools like Excel and Python"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"March 2023 - September 2023","type":"Remote ","position":"Customer Relationship Executive","bullets":"Handled inquiries resolved issues and coordinated with internal teams to ensure smooth service delivery , Managed client communications and maintained positive relationships to support customer satisfaction and retention"}],"education":{"universityName":"University of Engineering and Technology Taxila","universityDate":"2021-2025","universityPara":"During my time at university, I developed a strong foundation in both software development and applied technology. I gained hands-on experience in web development using the MERN stack (MongoDB, Express.js, React, and Node.js), allowing me to build dynamic and responsive web applications. I also became familiar with CRM software for business process tracking and customer management. My coursework and projects included exposure to quality assurance tools like Postman and Zest for API testing and process validation. Additionally, I explored computer vision and automation using Python, which helped me understand how to build intelligent systems. These experiences have equipped me with a versatile technical skill set and a problem-solving mindset that I continue to build on."},"languages":["Javascript","HTML5","CSS","Python","Tailwind"],"frameworks":["React","Typescript","NodeJs"],"others":["Figma","Canva","Hubspot"]}}
